In [2]:
import numpy 
import pandas

In [3]:
liste1 = ["python","java","html"]

In [4]:
liste2 = [10,20,30]

In [5]:
pandas.Series(liste1,liste2)

10    python
20      java
30      html
dtype: object

In [6]:
pandas.Series(liste1)

0    python
1      java
2      html
dtype: object

In [7]:
dizi = numpy.array([10,20,30,40,50])

In [8]:
dizi

array([10, 20, 30, 40, 50])

In [9]:
pandas.Series(dizi)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [10]:
pandas.Series(data = dizi , index = ["A","B","C","D","E"])

A    10
B    20
C    30
D    40
E    50
dtype: int32

In [11]:
sozluk = {"java":10,"python":20,"hmtl":30}

In [12]:
pandas.Series(sozluk)

java      10
python    20
hmtl      30
dtype: int64

In [13]:
seri1 = pandas.Series([10,20,30],["java","python","html"])

In [14]:
seri2 = pandas.Series([1,2,3],["java","python","css"])

In [15]:
seri1 + seri2

css        NaN
html       NaN
java      11.0
python    22.0
dtype: float64

In [16]:
toplam = seri1 + seri2

In [17]:
toplam["css"]

nan

In [18]:
toplam["python"]

22.0

In [19]:
numpy.random.randn(3,3)

array([[-0.54068361,  0.41996204,  1.67279286],
       [-0.0902658 , -1.29250427, -1.22656229],
       [ 1.88388132, -0.85148825, -1.67079252]])

In [20]:
dataframe = pandas.DataFrame(data = numpy.random.randn(3,3),index = ["A","B","C"],columns = ["kolon1","kolon2","kolon3"])

In [21]:
dataframe

     kolon1    kolon2    kolon3
A -0.653011  1.545821  0.232361
B  0.698335  0.886753 -0.326346
C  0.098593 -1.330973 -0.404135

In [22]:
dataframe["kolon1"]

A   -0.653011
B    0.698335
C    0.098593
Name: kolon1, dtype: float64

In [23]:
dataframe.loc["A"]

kolon1   -0.653011
kolon2    1.545821
kolon3    0.232361
Name: A, dtype: float64

In [24]:
dataframe[["kolon1","kolon2"]]

     kolon1    kolon2
A -0.653011  1.545821
B  0.698335  0.886753
C  0.098593 -1.330973

In [25]:
dataframe["kolon4"] = pandas.Series(numpy.random.randn(3),["A","B","C"])

In [26]:
dataframe

     kolon1    kolon2    kolon3    kolon4
A -0.653011  1.545821  0.232361 -1.002226
B  0.698335  0.886753 -0.326346  0.873368
C  0.098593 -1.330973 -0.404135  0.498811

In [27]:
dataframe["kolon5"] = dataframe["kolon1"] + dataframe["kolon3"]

In [28]:
dataframe

     kolon1    kolon2    kolon3    kolon4    kolon5
A -0.653011  1.545821  0.232361 -1.002226 -0.420650
B  0.698335  0.886753 -0.326346  0.873368  0.371988
C  0.098593 -1.330973 -0.404135  0.498811 -0.305542

In [29]:
dataframe.drop("kolon5",axis = 1)  #kolon5 i siler . kolon silmek istersek axis e bir yazmalıyız

     kolon1    kolon2    kolon3    kolon4
A -0.653011  1.545821  0.232361 -1.002226
B  0.698335  0.886753 -0.326346  0.873368
C  0.098593 -1.330973 -0.404135  0.498811

In [30]:
dataframe          #kolon5 tekrardan geri geldi

     kolon1    kolon2    kolon3    kolon4    kolon5
A -0.653011  1.545821  0.232361 -1.002226 -0.420650
B  0.698335  0.886753 -0.326346  0.873368  0.371988
C  0.098593 -1.330973 -0.404135  0.498811 -0.305542

In [31]:
dataframe.drop("kolon5",axis = 1,inplace = True)   #bu şekilde kalıcı siler

In [32]:
dataframe.loc["A"]

kolon1   -0.653011
kolon2    1.545821
kolon3    0.232361
kolon4   -1.002226
Name: A, dtype: float64

In [33]:
dataframe.iloc[0]

kolon1   -0.653011
kolon2    1.545821
kolon3    0.232361
kolon4   -1.002226
Name: A, dtype: float64

In [34]:
dataframe.loc["A","kolon4"]

-1.0022262818735592

In [35]:
dataframe.loc[["A","B"],["kolon1","kolon2"]]

     kolon1    kolon2
A -0.653011  1.545821
B  0.698335  0.886753

In [36]:
dataframe = pandas.DataFrame(numpy.random.randn(4,3),["A","B","C","D"],["kolon1","kolon2","kolon3"])

In [37]:
dataframe

     kolon1    kolon2    kolon3
A  2.343784 -1.373339 -0.120889
B -1.004477 -0.447792 -1.430073
C -0.872891  0.616486 -1.913600
D  0.595521 -0.206129  0.050267

In [38]:
dataframe > 0.5

   kolon1  kolon2  kolon3
A    True   False   False
B   False   False   False
C   False    True   False
D    True   False   False

In [39]:
dataframe < 0

   kolon1  kolon2  kolon3
A   False    True    True
B    True    True    True
C    True   False    True
D   False    True   False

In [40]:
uyanlar = dataframe < 0

In [41]:
dataframe[uyanlar]

     kolon1    kolon2    kolon3
A       NaN -1.373339 -0.120889
B -1.004477 -0.447792 -1.430073
C -0.872891       NaN -1.913600
D       NaN -0.206129       NaN

In [42]:
dataframe[dataframe > 1]

     kolon1  kolon2  kolon3
A  2.343784     NaN     NaN
B       NaN     NaN     NaN
C       NaN     NaN     NaN
D       NaN     NaN     NaN

In [43]:
dataframe["kolon1"] > 0

A     True
B    False
C    False
D     True
Name: kolon1, dtype: bool

In [44]:
dataframe[dataframe["kolon1"] > 0]

     kolon1    kolon2    kolon3
A  2.343784 -1.373339 -0.120889
D  0.595521 -0.206129  0.050267

In [45]:
dataframe[(dataframe["kolon1"]>0) & (dataframe["kolon2"] > 0)]

Empty DataFrame
Columns: [kolon1, kolon2, kolon3]
Index: []

In [46]:
dataframe[(dataframe["kolon1"]>0) | (dataframe["kolon2"] > 0)]

     kolon1    kolon2    kolon3
A  2.343784 -1.373339 -0.120889
C -0.872891  0.616486 -1.913600
D  0.595521 -0.206129  0.050267

In [47]:
dataframe["kolon4"] = pandas.Series(numpy.random.randn(4),["A","B","C","D"])

In [48]:
dataframe

     kolon1    kolon2    kolon3    kolon4
A  2.343784 -1.373339 -0.120889 -1.218013
B -1.004477 -0.447792 -1.430073  1.760147
C -0.872891  0.616486 -1.913600 -0.223125
D  0.595521 -0.206129  0.050267 -0.614537

In [49]:
dataframe["kolon5"] = numpy.random.randn(4)

In [50]:
dataframe

     kolon1    kolon2    kolon3    kolon4    kolon5
A  2.343784 -1.373339 -0.120889 -1.218013 -0.189208
B -1.004477 -0.447792 -1.430073  1.760147  0.381398
C -0.872891  0.616486 -1.913600 -0.223125  0.705928
D  0.595521 -0.206129  0.050267 -0.614537 -0.889759

In [51]:
dataframe["kolon6"] = ["a","b","c","d"]

In [52]:
dataframe

     kolon1    kolon2    kolon3    kolon4    kolon5 kolon6
A  2.343784 -1.373339 -0.120889 -1.218013 -0.189208      a
B -1.004477 -0.447792 -1.430073  1.760147  0.381398      b
C -0.872891  0.616486 -1.913600 -0.223125  0.705928      c
D  0.595521 -0.206129  0.050267 -0.614537 -0.889759      d

In [53]:
dataframe.set_index("kolon6")       #bu kalıcı değiştirmez

          kolon1    kolon2    kolon3    kolon4    kolon5
kolon6
a       2.343784 -1.373339 -0.120889 -1.218013 -0.189208
b      -1.004477 -0.447792 -1.430073  1.760147  0.381398
c      -0.872891  0.616486 -1.913600 -0.223125  0.705928
d       0.595521 -0.206129  0.050267 -0.614537 -0.889759

In [54]:
dataframe.set_index("kolon6",inplace = True)     #bu şekilde kalıcı olarak değişir

In [55]:
dataframe

          kolon1    kolon2    kolon3    kolon4    kolon5
kolon6
a       2.343784 -1.373339 -0.120889 -1.218013 -0.189208
b      -1.004477 -0.447792 -1.430073  1.760147  0.381398
c      -0.872891  0.616486 -1.913600 -0.223125  0.705928
d       0.595521 -0.206129  0.050267 -0.614537 -0.889759

In [56]:
dataframe.index.names

FrozenList(['kolon6'])

In [57]:
gruplar = ["grup1","grup1","grup1","grup2","grup2","grup2","grup3","grup3","grup3"]
indexler = ["index1","index2","index3","index1","index2","index3","index1","index2","index3"]

In [58]:
list(zip(gruplar,indexler))

[('grup1', 'index1'),
 ('grup1', 'index2'),
 ('grup1', 'index3'),
 ('grup2', 'index1'),
 ('grup2', 'index2'),
 ('grup2', 'index3'),
 ('grup3', 'index1'),
 ('grup3', 'index2'),
 ('grup3', 'index3')]

In [59]:
birlestirme = list(zip(gruplar,indexler))

In [60]:
birlestirme = pandas.MultiIndex.from_tuples(birlestirme)

In [61]:
birlestirme

MultiIndex([('grup1', 'index1'),
            ('grup1', 'index2'),
            ('grup1', 'index3'),
            ('grup2', 'index1'),
            ('grup2', 'index2'),
            ('grup2', 'index3'),
            ('grup3', 'index1'),
            ('grup3', 'index2'),
            ('grup3', 'index3')],
           )

In [62]:
dataframe = pandas.DataFrame(numpy.random.randn(9,3),birlestirme,columns = ["kolon1","kolon2","kolon3"])

In [63]:
dataframe

                kolon1    kolon2    kolon3
grup1 index1 -1.721983 -0.687141  1.105149
      index2  0.705745 -1.712028  0.790002
      index3 -0.481775 -0.016269  1.233630
grup2 index1 -0.528608 -1.189648  0.105786
      index2  0.616535  0.695706  1.371412
      index3 -0.814304 -0.060133 -0.304634
grup3 index1  0.745895  1.709092  0.300426
      index2 -0.030110 -1.217938  1.308305
      index3  2.014133 -0.911344  0.164337

In [64]:
dataframe["kolon1"]

grup1  index1   -1.721983
       index2    0.705745
       index3   -0.481775
grup2  index1   -0.528608
       index2    0.616535
       index3   -0.814304
grup3  index1    0.745895
       index2   -0.030110
       index3    2.014133
Name: kolon1, dtype: float64

In [65]:
dataframe.loc["grup1"]

          kolon1    kolon2    kolon3
index1 -1.721983 -0.687141  1.105149
index2  0.705745 -1.712028  0.790002
index3 -0.481775 -0.016269  1.233630

In [66]:
dataframe.loc[["grup2","grup3"]]

                kolon1    kolon2    kolon3
grup2 index1 -0.528608 -1.189648  0.105786
      index2  0.616535  0.695706  1.371412
      index3 -0.814304 -0.060133 -0.304634
grup3 index1  0.745895  1.709092  0.300426
      index2 -0.030110 -1.217938  1.308305
      index3  2.014133 -0.911344  0.164337

In [67]:
dataframe.loc["grup1"].loc["index1"]

kolon1   -1.721983
kolon2   -0.687141
kolon3    1.105149
Name: index1, dtype: float64

In [68]:
dataframe.loc["grup2"].loc["index2"]["kolon1"]

0.616535407220384

In [69]:
dataframe.index.names

FrozenList([None, None])

In [70]:
dataframe.index.names = ["gruplar","indexler"]

In [71]:
dataframe

                    kolon1    kolon2    kolon3
gruplar indexler
grup1   index1   -1.721983 -0.687141  1.105149
        index2    0.705745 -1.712028  0.790002
        index3   -0.481775 -0.016269  1.233630
grup2   index1   -0.528608 -1.189648  0.105786
        index2    0.616535  0.695706  1.371412
        index3   -0.814304 -0.060133 -0.304634
grup3   index1    0.745895  1.709092  0.300426
        index2   -0.030110 -1.217938  1.308305
        index3    2.014133 -0.911344  0.164337

In [72]:
dataframe.xs("grup1")

            kolon1    kolon2    kolon3
indexler
index1   -1.721983 -0.687141  1.105149
index2    0.705745 -1.712028  0.790002
index3   -0.481775 -0.016269  1.233630

In [73]:
dataframe.xs("grup2").xs("index3")

kolon1   -0.814304
kolon2   -0.060133
kolon3   -0.304634
Name: index3, dtype: float64

In [74]:
dataframe.xs("grup3").xs("index1").xs("kolon1")

0.7458954246361279

In [75]:
dataframe.xs("index1",level = "indexler")

           kolon1    kolon2    kolon3
gruplar
grup1   -1.721983 -0.687141  1.105149
grup2   -0.528608 -1.189648  0.105786
grup3    0.745895  1.709092  0.300426

In [76]:
array = numpy.array([[10,20,numpy.nan],[1,numpy.nan,numpy.nan],[100,numpy.nan,300]])

In [77]:
array

array([[ 10.,  20.,  nan],
       [  1.,  nan,  nan],
       [100.,  nan, 300.]])

In [78]:
dataframe = pandas.DataFrame(array,index = ["index1","index2","index3"],columns = ["kolon1","kolon2","kolon3"])

In [79]:
dataframe

        kolon1  kolon2  kolon3
index1    10.0    20.0     NaN
index2     1.0     NaN     NaN
index3   100.0     NaN   300.0

In [80]:
dataframe.dropna()         #indexinde nan olan bütün kolonları siler.

Empty DataFrame
Columns: [kolon1, kolon2, kolon3]
Index: []

In [81]:
dataframe.dropna(axis = 1)     #kolonunnda nan olan bütün indexleri siler.

        kolon1
index1    10.0
index2     1.0
index3   100.0

In [82]:
dataframe.dropna(thresh = 2)           #indexte minimum 2 nan olmayan değer varsa silme demek.

        kolon1  kolon2  kolon3
index1    10.0    20.0     NaN
index3   100.0     NaN   300.0

In [83]:
dataframe.fillna(value = 1)          #nan olan değerleri 1 yapar

        kolon1  kolon2  kolon3
index1    10.0    20.0     1.0
index2     1.0     1.0     1.0
index3   100.0     1.0   300.0

In [84]:
dataframe

        kolon1  kolon2  kolon3
index1    10.0    20.0     NaN
index2     1.0     NaN     NaN
index3   100.0     NaN   300.0

In [85]:
dataframe.sum()          #kolon kolon toplar

kolon1    111.0
kolon2     20.0
kolon3    300.0
dtype: float64

In [86]:
dataframe.sum().sum()

431.0

In [87]:
dataframe.size      #veri sayısını verir.

9

In [88]:
dataframe.isnull().sum()              #null olan veri sayısını verir.

kolon1    0
kolon2    2
kolon3    2
dtype: int64

In [89]:
dataframe.isnull().sum().sum()        #toplam null sayısı

4

In [90]:
set = {
    "departman":["bilişim","insan kaynakları","üretim","üretim","bilişim","insan kaynakları"],
    "çalışan":["çalışan1","çalışan2","çalışan3","çalışan4","çalışan5","çalışan6"],
    "maaş":[3000,3500,2500,4500,4000,2000]
    }

In [91]:
dataframe = pandas.DataFrame(set)

In [92]:
dataframe

          departman   çalışan  maaş
0           bilişim  çalışan1  3000
1  insan kaynakları  çalışan2  3500
2            üretim  çalışan3  2500
3            üretim  çalışan4  4500
4           bilişim  çalışan5  4000
5  insan kaynakları  çalışan6  2000

In [93]:
departman_grup = dataframe.groupby("departman")

In [94]:
departman_grup

In [95]:
departman_grup.sum()

                  maaş
departman
bilişim           7000
insan kaynakları  5500
üretim            7000

In [96]:
dataframe.groupby("departman").sum()

                  maaş
departman
bilişim           7000
insan kaynakları  5500
üretim            7000

In [97]:
dataframe.groupby("departman").sum().loc["bilişim"]

maaş    7000
Name: bilişim, dtype: int64

In [98]:
int(dataframe.groupby("departman").sum().loc["insan kaynakları"])

5500

In [99]:
dataframe.groupby("departman").count()

                  çalışan  maaş
departman
bilişim                 2     2
insan kaynakları        2     2
üretim                  2     2

In [100]:
dataframe.groupby("departman").max()

                   çalışan  maaş
departman
bilişim           çalışan5  4000
insan kaynakları  çalışan6  3500
üretim            çalışan4  4500

In [101]:
dataframe.groupby("departman").min()["maaş"]

departman
bilişim             3000
insan kaynakları    2000
üretim              2500
Name: maaş, dtype: int64

In [102]:
dataframe.groupby("departman").min()["maaş"]["üretim"]

2500

In [103]:
dataframe.groupby("departman").mean()

                    maaş
departman
bilişim           3500.0
insan kaynakları  2750.0
üretim            3500.0

In [104]:
set1 = {
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"]
}
set2 = {
    "A":["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"]
}

In [105]:
dataframe1 = pandas.DataFrame(set1,index = [1,2,3,4])
dataframe2 = pandas.DataFrame(set2,index = [5,6,7,8])

In [106]:
dataframe1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [107]:
dataframe2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [108]:
pandas.concat([dataframe1,dataframe2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [109]:
pandas.concat([dataframe1,dataframe2],axis = 1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [110]:
set1 = {
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"]
}
set2 = {
    "X":["X1","X2","X3"],
    "Y":["Y1","Y2","Y3"]
}

In [111]:
dataframe1 = pandas.DataFrame(set1,index = [1,2,3,4])
dataframe2 = pandas.DataFrame(set2,index = [1,2,3])

In [112]:
dataframe1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [113]:
dataframe2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [114]:
dataframe1.join(dataframe2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [115]:
dataframe2.join(dataframe1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

In [116]:
set1 = {
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"]
}
set2 = {
    "A":["A1","X2","X3"],
    "B":["B1","B2","B3"]
}

In [117]:
dataframe1 = pandas.DataFrame(set1,index = [1,2,3,4])
dataframe2 = pandas.DataFrame(set2,index = [1,2,3])

In [118]:
dataframe1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [119]:
dataframe2

    A   B
1  A1  B1
2  X2  B2
3  X3  B3

In [120]:
pandas.merge(dataframe1,dataframe2,on = "B")        #ortak olanları verir B kolonuna göre

  A_x   B A_y
0  A1  B1  A1
1  A2  B2  X2
2  A3  B3  X3

In [121]:
dataframe = pandas.DataFrame({
    "kolon1":[1,2,3,4,5,6],
    "kolon2":[100,100,200,300,300,100],
    "kolon3":["kişi1","kişi2","kişi3","kişi4","kişi5","kişi6"]
})

In [122]:
dataframe

   kolon1  kolon2 kolon3
0       1     100  kişi1
1       2     100  kişi2
2       3     200  kişi3
3       4     300  kişi4
4       5     300  kişi5
5       6     100  kişi6

In [123]:
dataframe.head(n = 4)      #ilk 4 satırı getirir.

   kolon1  kolon2 kolon3
0       1     100  kişi1
1       2     100  kişi2
2       3     200  kişi3
3       4     300  kişi4

In [124]:
dataframe["kolon2"].unique()            #seçilen kolondaki benzersiz değerleri getirir.

array([100, 200, 300], dtype=int64)

In [125]:
dataframe["kolon2"].nunique()          #seçilen kolondaaki benzersiz değerlerin kaç tane olduğunu getirir.

3

In [126]:
dataframe["kolon2"].value_counts()      #seçilen kolondaki değerlerden kaç tane olduğunu verir.

100    3
300    2
200    1
Name: kolon2, dtype: int64

In [127]:
dataframe[dataframe["kolon1"]>=4]

   kolon1  kolon2 kolon3
3       4     300  kişi4
4       5     300  kişi5
5       6     100  kişi6

In [128]:
dataframe[(dataframe["kolon1"]>=4) & (dataframe["kolon2"] == 300)]

   kolon1  kolon2 kolon3
3       4     300  kişi4
4       5     300  kişi5

In [129]:
def carp(x):
    
    return x*5

In [130]:
carp(2)

10

In [131]:
dataframe["kolon2"].apply(carp)

0     500
1     500
2    1000
3    1500
4    1500
5     500
Name: kolon2, dtype: int64

In [132]:
dataframe["kolon2"] = dataframe["kolon2"].apply(carp)

In [133]:
dataframe

   kolon1  kolon2 kolon3
0       1     500  kişi1
1       2     500  kişi2
2       3    1000  kişi3
3       4    1500  kişi4
4       5    1500  kişi5
5       6     500  kişi6

In [134]:
carp = lambda x : x * 5     #bu şekilde fonsiyon oluşturulur.

In [135]:
carp(2)

10

In [136]:
 dataframe["kolon2"].apply(lambda x : x * 2)

0    1000
1    1000
2    2000
3    3000
4    3000
5    1000
Name: kolon2, dtype: int64

In [137]:
dataframe["kolon3"].apply(len)       #kişi isimlerinin harf sayısı

0    5
1    5
2    5
3    5
4    5
5    5
Name: kolon3, dtype: int64

In [138]:
dataframe.drop("kolon3",axis = 1)     #kalıcı silme için inplace = True  yazılır

   kolon1  kolon2
0       1     500
1       2     500
2       3    1000
3       4    1500
4       5    1500
5       6     500

In [139]:
dataframe.columns

Index(['kolon1', 'kolon2', 'kolon3'], dtype='object')

In [140]:
dataframe.index

RangeIndex(start=0, stop=6, step=1)

In [141]:
len(dataframe.index)

6

In [142]:
dataframe.index.names

FrozenList([None])

In [143]:
dataframe.sort_values("kolon2")

   kolon1  kolon2 kolon3
0       1     500  kişi1
1       2     500  kişi2
5       6     500  kişi6
2       3    1000  kişi3
3       4    1500  kişi4
4       5    1500  kişi5

In [144]:
dataframe.sort_values("kolon2",ascending = False)

   kolon1  kolon2 kolon3
3       4    1500  kişi4
4       5    1500  kişi5
2       3    1000  kişi3
0       1     500  kişi1
1       2     500  kişi2
5       6     500  kişi6

In [147]:
dataframe = pandas.DataFrame({
    
    "ay":["mart","nisan","mayıs","mart","nisan","mayıs","mart","nisan","mayıs"],
    "şehir":["ankara","ankara","ankara","istanbul","istanbul","istanbul","izmir","izmir","izmir"],
    "nem":[10,25,50,21,67,80,30,70,75]
})

In [148]:
dataframe

      ay     şehir  nem
0   mart    ankara   10
1  nisan    ankara   25
2  mayıs    ankara   50
3   mart  istanbul   21
4  nisan  istanbul   67
5  mayıs  istanbul   80
6   mart     izmir   30
7  nisan     izmir   70
8  mayıs     izmir   75

In [149]:
dataframe.pivot_table(index = "ay" , columns = "şehir" , values = "nem")

şehir  ankara  istanbul  izmir
ay
mart       10        21     30
mayıs      50        80     75
nisan      25        67     70

In [150]:
dataframe.pivot_table(index = "şehir" , columns = "ay" , values = "nem")

ay        mart  mayıs  nisan
şehir
ankara      10     50     25
istanbul    21     80     67
izmir       30     75     70